[{"id":4,"title":"My First Post, Yo!","subtitle":"This is a subtitle.","description":"Happy Pride month! In this tutorial, I'll share a handful of my favourite animation tricks. You'll learn how to build an animated wavy pride flag using CSS keyframes and linear gradients. We'll also see how to make it dynamic using React. 🏳️‍🌈","author":"Dave Jones","date":"December 11, 2019","timestamp":1576051200,"content":"\nWelcome to My Blog. _It's a beautiful thing._ I hope you'll have as much fun reading my posts as I have writing them. Well, before we go any further, allow me to introduce myself. I'm Dave Jones. I'm 34, and from Montreal, Canada.\n","toc":"","category":"Personal","image":""},{"id":3,"title":"My First Post, Yo!","subtitle":"This is a subtitle.","description":"Happy Pride month! In this tutorial, I'll share a handful of my favourite animation tricks. You'll learn how to build an animated wavy pride flag using CSS keyframes and linear gradients. We'll also see how to make it dynamic using React. 🏳️‍🌈","author":"Dave Jones","date":"December 11, 2019","timestamp":1576051200,"content":"\nWelcome to My Blog. _It's a beautiful thing._ I hope you'll have as much fun reading my posts as I have writing them. Well, before we go any further, allow me to introduce myself. I'm Dave Jones. I'm 34, and from Montreal, Canada.\n","toc":"","category":"Tutorial","image":""},{"id":2,"title":"A Day in the Life of an Unemployed Software Engineer","subtitle":"Working a full-time job to get a full-time job","description":"In the fast-paced and ever-evolving world of software engineering, being unemployed doesn't mean a software engineer's journey comes to a halt. Instead, it becomes a relentless pursuit of growth and competitiveness. Join us as we dive into the daily life of me, an unemployed software engineer, exploring the challenges I face and the proactive steps I take to navigate a demanding job market.","author":"No author given","date":"06/20/23","timestamp":1687244400,"content":"\n<img src=\"https://i.imgur.com/HFDjmiz.jpg\" alt=\"Header\" />\nAs an unemployed software engineer, my days are far from ordinary. Contrary to popular belief, being unemployed doesn't mean I'm lounging around waiting for opportunities to come knocking on my door. Instead, I embark on a relentless journey to stay competitive in an industry that demands continuous growth and adaptation. In this blog post, I'll take you through a typical day in my life, shedding light on the challenges I face and the steps I take to overcome them, all while striving to navigate a job market that often sets daunting requirements for entry-level positions.\n\n# Daily Schedule\n\n<strong><u>8:30am - 9:00am: Morning Routine</u></strong>\nEach morning, I rise with determination, ready to tackle the day ahead. To kickstart my routine, I engage in activities that fuel my mind and spirit. I dedicate time to browsing through emails, checking social media accounts, and staying updated with the latest industry news. This morning warm-up not only helps me stay connected but also fuels my motivation to excel in a field that is as challenging as it is rewarding. Sometimes, I'll finish off this half-hour period with a round of Fortnite, which is my favorite way to start the day off on a fun and positive note.\n\n<strong><u>9:00am - 10:00am: Job Searching Activities, Pt. 1</u></strong>\nImmediately following my morning warm-up is an hour of job searching activities. This includes researching companies to potentially apply for, writing cover letters, completing applications, networking, and outreach. Sometimes, I'll spend the entire hour just filling out applications, as I believe someone is bound to recognize my potential; I just have to find the right opportunity.\n\n<strong><u>10:00am - 12:00pm: Data Structures & Algorithms Studies/Practice</u></strong>\nThe next two hours are allocated to studying and practicing Data Structures and Algorithms – typically one hour for studies and one hour for practice. I utilize various resources like textbooks, online platforms, and coding challenges such as Leetcode and HackerRank. This helps me take notes, clarify any confusion, and solve problems that might appear in technical interviews. Not only does this preparation sharpen my skills, but it also allows me to grow as an engineer. Given my love for learning, spending hours on this never exhausts me.\n\n<strong><u>12:00pm - 2:00pm: Language/Technology Studies/Practice</u></strong>\nAfter a short break, I dedicate an hour to studying a specific programming language or technology. Currently, I'm focused on learning TypeScript, particularly its application with React. As with Data Structures and Algorithms, I spend an hour studying and taking notes, followed by an hour of hands-on practice. There's no better way to learn a new language or technology than by actively using it.\n\n<strong><u>2:00pm - 3:00pm: Lunch break</u></strong>\nAfter completing my language/technology studies, I take an hour for myself to have lunch and indulge in some video games. Despite my passion for software engineering and love for learning, even I need a mental break amidst the day's activities.\n\n<strong><u>3:00pm - 5:00pm: Project Work</u></strong>\nFollowing lunch, my favorite time of the day arrives – project work. I spend around two hours either enhancing existing projects or starting new ones. My Reddit clone, Ribbit, is an ongoing project that always captures my interest, but I also explore other exciting ideas that come to mind.\n\n<strong><u>5:00pm - 6:00pm: Job Searching Activities, Pt. 2</u></strong>\nAfter a final 15-minute break, I allocate another hour to job searching activities. I find it more efficient to split the time into two sessions rather than doing it consecutively. This way, I can accomplish more without feeling overwhelmed.\n\n<strong><u>6:00pm - 6:30pm: Evening Cooldown</u></strong>\nFinally, I end my day just as I started it, with what I call the \"evening cooldown.\" I check my email and job board accounts once more, ensuring I haven't missed any important updates. Additionally, I stay updated with any new developments in the software engineering realm. Recently, I've made it a point to officially \"clock off\" during this time to prioritize my family, friends, and other hobbies. As much as I enjoy software engineering, maintaining a healthy work-life balance is crucial.\n\n# Conclusion\n\nAs an unemployed software engineer, my days are packed with activities aimed at growth and staying competitive. From morning warm-ups to job searching, studying data structures and algorithms, learning new languages and technologies, indulging in project work, and finally, winding down in the evening, I strive to make the most of my circumstances. While unemployment poses challenges, I remain determined to forge ahead, knowing that my efforts will eventually lead to fulfilling opportunities in this dynamic industry.\n","toc":"Daily Schedule/Conclusion","category":"Personal","image":"day-in-life-img.jpg"},{"id":1,"title":"whoami","subtitle":"No subtitle given","description":"Hello! I'm Sara, and this is a little introduction to me, the author of this here blog.","author":"No author given","date":"June 15, 2023","timestamp":1686812400,"content":"\nWelcome to Musings of a Software Engineer! I'm Sara, your hostess for the evening and the voice behind this blog. This space is all about my adventures as a software engineer. I'll be sharing my thoughts, experiences, and insights on everything related to the world of coding. From my day-to-day projects to my takes on the latest trends, I aim to cover it all.\n\nI hail from sunny California. Over the years, I've developed a serious passion for software engineering, and I am over the moon about it; finally, after spending the better part of a decade searching for what I want to do for the rest of my life, I feel that I've found my true calling, and the idea that I can get paid for doing what I love is an absolute dream come true.\n\nOnce I knew I wanted to take my interest in this field seriously, my journey began with frontend engineering. After a year of self-study diving into various frontend languages and technologies, I took a leap and enrolled in App Academy for fullstack training. Graduating in February was a major milestone, and now I'm eagerly seeking job opportunities while both honing my existing skills and learning as much as I can.\n\nIn my spare time, you'll most likely find me glued to my computer, either studying and expanding my knowledge or working on some sort of project. These days, my focus revolves around Ribbit, a pixel-perfect Reddit clone that I am incredibly proud of, and delving into the realm of using TypeScript with React. Additionally, I make it a priority to deepen my understanding of Data Structures & Algorithms, both to ace potential technical interviews and to continuously grow as a developer.\n\nI'm a friendly soul who's always up for a chat. Don't hesitate to reach out if you have any questions or simply want to share your thoughts; I promise I won't bite. In the meantime, I hope you enjoy reading the Musings of a Software Engineer!\n","toc":"","category":"Personal","image":""}]